src/test/resources/org/apache/servicemix/http/soap-request-12.xml

<?xml version="1.0"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
			  xmlns:ns1="urn:xmethods-delayed-quotes"
			  xmlns:se="http://www.w3.org/2003/05/soap-envelope">
	<env:Body>
	    <!-- Comment -->
		<ns1:getQuote 
			se:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

			<ns1:symbol>IBM</ns1:symbol>

		</ns1:getQuote>
	</env:Body>
</env:Envelope>
