trunk/code/docs/en/dguide/examples/stock-quote.xml

<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <NS0:getQuote xmlns:NS0="urn:xmethods-delayed-quotes">
      <symbol xsi:type="xsd:string"></symbol>
    </NS0:getQuote>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
